[
	{
		"slug": "voices-from-libya-demand-an-end-to-eu-funded-torture",
		"title": "VOICES FROM LIBYA DEMAND AN END TO EU-FUNDED TORTURE",
		"createdAt": "2024-02-21T10:52:37Z",
		"author": "Azeb",
		"content": "The desperate pleas echo across the Mediterranean Evacuate us from Libya! This is a cry for survival from thousands of refugees trapped in a nightmare. Their harrowing reality: Libyan detention centers, notorious for systematic torture, rape, and murder. And the shocking truth: The EU is complicit./n Imagine fleeing war and persecution, only to land in a hell on earth. In Libya, that'/s the fate of countless refugees, primarily from Africa. Brutality reigns in detention centers, documented by the UN as crimes against humanity. People are electrocuted, sexually assaulted, and even shot for daring to dream of freedom. Overcrowding breeds disease, while starvation weakens already-battered bodies./n The EU isn't just turning a blind eye; it's fueling the flames. By funding the Libyan Coast Guard, notorious for intercepting refugees at sea and returning them to this abyss, the EU becomes an accessory to torture, rape and enslavement. This policy, born from a desire to externalize border control, throws human lives under the bus./n But amidst the suffering, resilience flickers. Refugees in Libya risk everything to raise their voices. They demand evacuation to safety, an end to EU-funded barbarity, and the dismantling of the deadly border regime that traps them. Their courage is an inspiration, a stark reminder of our shared humanity./n The responsibility lies squarely on the shoulders of the EU and its member states. Immediate action is paramount. Evacuate refugees to safe havens. End all cooperation with Libyan authorities implicated in abuses. Establish safe and legal passage to Europe. Dismantle the inhumane border regime that turns the Mediterranean into a graveyard./n This isn't just about statistics and policy; it's about lives. Each agonizing day in detention is a stolen chance at safety and dignity. We cannot turn away. Join the #EvacuateRefugeesFromLibya movement. Sign petitions, contact your representatives, and raise your voice. Together, we can demand an end to this EU-funded barbarity and offer refugees the hope they deserve./n Remember, silence is complicity. Let's stand with our brothers and sisters in Libya. Their fight for freedom is our fight, too./n Don't forget to share this blog post and use the hashtag #EvacuateRefugeesFromLibya to amplify the call for action!"
	},
	{
		"slug": "stop-italy-libya-memorandum-protest-on-15-october-2022",
		"title": "PROTEST ON 15 OCTOBER 2022: STOP ITALY-LIBYA MEMORANDUM!",
		"createdAt": "2024-02-25T00:43:54Z",
		"author": "Azeb",
		"content": "STOP Italy-Libya Memorandum!!/n/n SATURDAY OCTOBER 15: PROTESTS IN FRONT OF ITALIAN EMBASSIES IN BERLIN, BRUSSELS, MADRID.../n/n Hi everyone!/n/n Refugees in Libya started their protests 329 days ago in October 2021 - still the conditions for refugees in Libya remain the same. They are exposed to structural violence, arbitrary detention in inhumane conditions, torture, enslavement and murder. People are still drowning in the Mediterranean daily or being pulled back by both the so-called Libyan coast guard (LYCG) and the newly established Stability Support Apparatus (SSA). The European Union (EU) is contributing to these atrocities daily by funding and training the so-called LYCG and supporting structures, which are holding the current system in place. Still, the echo of the protest of Refugees in Libya is ignored in the European public discourse./n Since 2017, when the Italy-Libya Memorandum of Understanding was signed, enough evidence, reports, statements have revealed the strong links between the so-called LYCG, Libyan migration authorities (DCIM), militias and smugglers. Enough reports denounced the crimes committed against refugees and migrants in Libya. The United Nations (UN) and International Criminal Court (ICC) are even denouncing crimes against humanity committed in the detention centers, which are sustained by the Memorandum./n On November 2, 2022 the Italy-Libya Memorandum is to be renewed - it is the backdoor of the cooperation of the EU with the militia-led Libyan coast guard, the hellish detention system, and the silent tragedies of thousands of invisible deaths in the Sahara at the southern border./n/n ❌ STOP Italy-Libya Memorandum!/n/n In Solidarity with Refugees in Libya, we want to take to the streets all over Europe to stop this memorandum, on Saturday October 15, in front of the Italian embassies of our cities./n/n All actors involved in this Memorandum have to put an end to this criminal agreement:/n • Italy has to cancel the renewal of the Memorandum./n • EU must stop financing activities in line with the Memorandum with hundreds of millions of Euros./n • Frontex, who's cooperating with the so-called LYCG in line with the Memorandum, has to be abolished./n • United Nations High Commissioner for Refugees (UNHCR) and International Organisation for Migration (IOM) must immediately start fulfilling their duty to protect refugees in Libya and stop providing a front for the EU and Italy to claim their actions are motivated by humanitarian aims./n/n By sustaining the Italy-Libya Memorandum, Italy, EU, the so-called LYCG, Frontex, UNHCR and IOM become accomplices of slavery, trafficking of human beings and crimes against humanity./n/n -Stop the Italy-Libya Memorandum!/n -Stop pullback of refugees and migrants to Libya, stop cooperation with so-called LYCG!/n -Free all refugees and migrants, close the detention centers!/n -Evacuation to safe countries for all refugees and migrants in Libya! /n/n EvacuateRefugeesFromLibya JOIN OUR ACTIONS ON OCTOBER 15 IN FRONT OF ITALIAN EMBASSIES IN BERLIN, BRUSSELS, MADRID OR ORGANIZE ACTION IN YOUR CITY ✊/n To join/organize actions, please contact: solidaritywithrefugeesinlibya@riseup.net"
	},
	{
		"slug": "film-screening-libya-no-escape-from-hell",
		"title": "FILM SCREENING: LIBYA, NO ESCAPE FROM HELL (SARA CRETA, 2021)",
		"createdAt": "2024-02-25T18:32:18Z",
		"author": "Azeb",
		"content": "Let's watch Sara Creta's \"Libya. No Escape From Hell\" (English), a 60 minutes-long documentary filmed in Libya on the entire detention system and the role of the militias; a joint-investigation on the role played by Frontex air surveillance assets in the intercepting and returning asylum-seekers to Libya. This documentary is an eye opener on the migrants' reality in Libya, but also on the horrific machine that has been set up. It invesitigates the role of those responsible for the situation that take advantage of European policies./n/nBetween Bridges, Adalbertstr. 43/n/n 18:30 Admission/n/n 19:00 Start/n/n 20:20 Discussion/n/n Suggested donation min. €5, which will go directly to the Refugees in Libya fundraiser at refugeesinlibya.org/donate/n/n You can also get a solidarity t-shirt for a donation of min. €15 to the same fundraiser./n/n Afterwards we are looking forward to a discussion with:/n/nSara, an award-winning photojournalist and documentary filmmaker, with extensive experience investigating human rights abuses, who will join online from Paris./n/n David, co-founder of the Refugees in Libya movement, human rights defender and survivor of the detention camps in Libya, who will join us online from Italy./n/n Biggie, a social worker from Sudan, survivor of the detention camps in Libya and activist with Solidarity with Refugees in Libya, based in Berlin./n/n Azeb, an Eritrean activist with United4Eritrea, Solidarity with Refugees in Libya and Abolish Frontex, based in Berlin./n/n And you 🤗"
	}
]
